f=open("malayalam_numbers_one_crore.txt",'w',encoding='utf-8')
mal_map={
    0: u"പൂജ്യം",
    1: u"ഒന്ന്",
    2: u"രണ്ട്",
    3: u"മൂന്ന്",
    4: u"നാല്",
    5: u"അഞ്ച്",
    6: u"ആറ്",
    7: u"ഏഴ്",
    8: u"എട്ട്",
    9: u"ഒൻപത്",
    10: u"പത്ത്",
    11: u"പതിനൊന്ന്",
    12: u"പന്ത്രണ്ട്",
    13: u"പതിമൂന്ന്",
    14: u"പതിനാല്",
    15: u"പതിനഞ്ച്",
    16: u"പതിനാറ്",
    17: u"പതിനേഴ്",
    18: u"പതിനെട്ട്",
    19: u"പത്തൊൻപത്",
    20: u"ഇരുപത്",
    21: u"ഇരുപത്തിയൊന്ന്",
    22: u"ഇരുപത്തിരണ്ട്",
    23: u"ഇരുപത്തിമൂന്ന്",
    24: u"ഇരുപത്തിനാല്",
    25: u"ഇരുപത്തിയഞ്ച്",
    26: u"ഇരുപത്തിയാറ്",
    27: u"ഇരുപത്തിയേഴ്",
    28: u"ഇരുപത്തിയെട്ട്",
    29: u"ഇരുപത്തിയൊൻപത്",
    30: u"മുപ്പത്",
    31: u"മുപ്പത്തിയൊന്ന്",
    32: u"മുപ്പത്തിരണ്ട്",
    33: u"മുപ്പത്തിമൂന്ന്",
    34: u"മുപ്പത്തിനാല്",
    35: u"മുപ്പത്തിയഞ്ച്",
    36: u"മുപ്പത്തിയാറ്",
    37: u"മുപ്പത്തിയേഴ്",
    38: u"മുപ്പത്തിയെട്ട്",
    39: u"മുപ്പത്തിയൊൻപത്",
    40: u"നാല്‍പ്പത്",
    41: u"നാല്‍പ്പത്തിയൊന്ന്",
    42: u"നാല്‍പ്പത്തിരണ്ട്",
    43: u"നാൽപ്പത്തിമൂന്ന്",
    44: u"നാൽപ്പത്തിനാല്",
    45: u"നാൽപ്പത്തിയഞ്ച്",
    46: u"നാല്‍പ്പത്തിയാറ്",
    47: u"നാല്‍പ്പത്തിയേഴ്",
    48: u"നാൽപ്പത്തിയെട്ട്",
    49: u"നാൽപ്പത്തിയൊൻപത്",
    50: u"അൻപത്",
    51: u"അൻപത്തിയൊന്ന്",
    52: u"അൻപത്തിരണ്ട്",
    53: u"അൻപത്തിമൂന്ന്",
    54: u"അൻപത്തിനാല്",
    55: u"അൻപത്തിയഞ്ച്",
    56: u"അൻപത്തിയാറ്",
    57: u"അൻപത്തിയേഴ്",
    58: u"അൻപത്തിയെട്ട്",
    59: u"അൻപത്തിയൊൻപത്",
    60: u"അറുപത്",
    61: u"അറുപത്തിയൊന്ന്",
    62: u"അറുപത്തിരണ്ട്",
    63: u"അറുപത്തിമൂന്ന്",
    64: u"അറുപത്തിനാല്",
    65: u"അറുപത്തിയഞ്ച്",
    66: u"അറുപത്തിയാറ്",
    67: u"അറുപത്തിയേഴ്",
    68: u"അറുപത്തിയെട്ട്",
    69: u"അറുപത്തിയൊൻപത്",
    70: u"എഴുപത്",
    71: u"എഴുപത്തിയൊന്ന്",
    72: u"എഴുപത്തിരണ്ട്",
    73: u"എഴുപത്തിമൂന്ന്",
    74: u"എഴുപത്തിനാല്",
    75: u"എഴുപത്തിയഞ്ച്",
    76: u"എഴുപത്തിയാറ്",
    77: u"എഴുപത്തിയേഴ്",
    78: u"എഴുപത്തിയെട്ട്",
    79: u"എഴുപത്തിയൊൻപത്",
    80: u"എൺപത്",
    81: u"എൺപത്തിയൊന്ന്",
    82: u"എൺപത്തിരണ്ട്",
    83: u"എൺപത്തിമൂന്ന്",
    84: u"എൺപത്തിനാല്",
    85: u"എൺപത്തിയഞ്ച്",
    86: u"എൺപത്തിയാറ്",
    87: u"എൺപത്തിയേഴ്",
    88: u"എൺപത്തിയെട്ട്",
    89: u"എൺപത്തിയൊൻപത്",
    90: u"തൊണ്ണൂറ്",
    91: u"തൊണ്ണൂറ്റിയൊന്ന്",
    92: u"തൊണ്ണൂറ്റിരണ്ട്",
    93: u"തൊണ്ണൂറ്റിമൂന്ന്",
    94: u"തൊണ്ണൂറ്റിനാല്",
    95: u"തൊണ്ണൂറ്റിയഞ്ച്",
    96: u"തൊണ്ണൂറ്റിയാറ്",
    97: u"തൊണ്ണൂറ്റിയേഴ്",
    98: u"തൊണ്ണൂറ്റിയെട്ട്",
    99: u"തൊണ്ണൂറ്റിയൊൻപത്"
}
numbers_Crores = ["കോടി"]
numbers_lakh = ["ലക്ഷം"]
numbers_tthousands =["പതിനായിരം","ഇരുപതിനായിരം","മുപ്പതിനായിരം","നാല്പതിനായിരം","അമ്പതിനായിരം","അറുപതിനായിരം",
                     "എഴുപതിനായിരം","എൺപതിനായിരം"]
numbers_Thousands = ["ആയിരം","രണ്ടായിരം ","മൂവായിരം","നാലായിരം ","അയ്യായിരം","ആറായിരം","ഏഴായിരം",
                     "എട്ടായിരം","ഒമ്പതിനായിരം"]
numbers_Hundreds = [ "നൂറ്","ഇരുന്നൂറ്","മുന്നൂറ്","നാനൂറ്","അഞ്ഞൂറ്","അറുന്നൂറ്","എഴുന്നൂറ്","എണ്ണൂറ്","തൊള്ളായിരം"]
def mal_no_gen(num):

    th = 1000
    tth = 10000
    lak = 100000
    cror= 10000000

#till 100
    if (num < 100):
        return(mal_map[num])
#till 1000
    if (100<=num < th):
        if num == 100:
            return(numbers_Hundreds[(num//100)-1])

        elif num%100 ==0 and num>100:
            return(numbers_Hundreds[(num//100)-1])

        else:
            if num//100==9:
                return(numbers_Hundreds[(num // 100) - 1].replace('ം','ത്തി ') + mal_map[num % 100])

            else:
                return(numbers_Hundreds[(num//100)-1].replace('റ്','റ്റി')+mal_map[num%100])
#till 10000
    if (th<=num<tth):
        if num ==1000:
            return(numbers_Thousands[(num//1000)-1])

        elif num % th == 0:
            if th<num<tth:
                return(numbers_Thousands[(num//1000)-1])

        else:
            return(numbers_Thousands[(num//1000)-1].replace('ം','ത്തി ')+mal_no_gen(num%th))
#till 1 lakh
    if (tth<=num<lak):
        if num == 10000:
            return (numbers_tthousands[(num // 10000) - 1])

        elif num %10000 == 0:
            if tth < num < lak:
                return (mal_map[(num // 10000)] + 'ആയിരം')
        elif 10000 < num <=10999:
            return (numbers_tthousands[(num // 10000) - 1].replace('ം', 'ത്തി ') + mal_no_gen(num % tth))

        else:
            if num%1000==0:
                return (mal_map[(num // 1000)] + 'ആയിരം')
            else:
                return (mal_map[(num // 1000)] + 'ആയിരത്തി' + mal_no_gen(num %1000))

#till 1 crore
    if (lak<=num<=cror):
        if num==lak:
            return ("ഒരു "+numbers_lakh[0])
        elif lak < num <= 199999:
            return ("ഒരു " + numbers_lakh[0].replace('ം', 'ത്തി ') + mal_no_gen(num % lak))
        elif 200000 < num <=999999:
            return ( mal_map[(num // 100000)]+" "+numbers_lakh[0].replace('ം', 'ത്തി ') + mal_no_gen(num % lak))
        elif num == cror:
            return ("ഒരു " +numbers_Crores[0])
        elif num%lak == 0:
            return (mal_map[(num //lak)]+" " +numbers_lakh[0] )
        else:
            if num%100000==0:
                return (mal_map[(num // 100000)] +" "+ numbers_lakh[0])
            else:
                return (mal_map[(num // 100000)] +" "+ numbers_lakh[0].replace('ം', 'ത്തി ') + mal_no_gen(num %100000))


for i in range(10000001):
    f.write(str(i)+':'+mal_no_gen(i))
    f.write('\n')
f.close()